Drifloon360/STM32l432VLVCTL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOA
#define VCP_TX_Pin GPIO_PIN_2
#define VCP_TX_GPIO_Port GPIOA
#define MOS_G10_Pin GPIO_PIN_3
#define MOS_G10_GPIO_Port GPIOA
#define MOS_G09_Pin GPIO_PIN_4
#define MOS_G09_GPIO_Port GPIOA
#define MOS_G08_Pin GPIO_PIN_5
#define MOS_G08_GPIO_Port GPIOA
#define MOS_G07_Pin GPIO_PIN_6
#define MOS_G07_GPIO_Port GPIOA
#define MOS_G06_Pin GPIO_PIN_7
#define MOS_G06_GPIO_Port GPIOA
#define MOS_G01_Pin GPIO_PIN_0
#define MOS_G01_GPIO_Port GPIOB
#define MOS_G04_Pin GPIO_PIN_1
#define MOS_G04_GPIO_Port GPIOB
#define MOS_G05_Pin GPIO_PIN_8
#define MOS_G05_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define VCP_RX_Pin GPIO_PIN_15
#define VCP_RX_GPIO_Port GPIOA
#define LD3_Pin GPIO_PIN_3
#define LD3_GPIO_Port GPIOB
#define MOS_G03_Pin GPIO_PIN_6
#define MOS_G03_GPIO_Port GPIOB
#define MOS_G02_Pin GPIO_PIN_7
#define MOS_G02_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
